tutorials/P100000_termalViscosity/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  leftWall
  {
    type            pressureInletOutletVelocity;
    value           uniform (0 0 0);
  }

  rightWall
  {
    type pressureInletOutletVelocity;
    value uniform (0 0 0);

  }

  bottom
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  tunnelWallsTop
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  topLava
  {
    type            fixedValue;
    value           uniform (0 0 0);
    }
  atmosphere
  {
    type            zeroGradient;

  }

  tunnelWallsLeft
  {
    type            fixedValue;
    value           uniform (0 0 0);
    }

  tunnelWallsLeft
  {
    type            fixedValue;
    value           uniform (0 0 0);
    }

  front
  {
      type            empty;

  }
  back
  {
    type            empty;

    }



}


// ************************************************************************* //
