tutorials/P100000_termalViscosity/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  leftWall
  {
    type            fixedValue;
    value           uniform 0;
  }

  rightWall
  {
    type uniformFixedValue;
    uniformValue table
    (
        (0 100000)
        (5000 100000)
        (6000 0)
        (20000 0)
    );
  }

  bottom
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }
  tunnelWallsTop
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }
  topLava
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }
  atmosphere
  {
      type            fixedValue;
      value           uniform 0;
  }

  tunnelWallsLeft
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }

  front
  {
    type            empty;
  }
  back
  {
    type           empty;
  }



}


// ************************************************************************* //
