tutorials/P100000_termalViscosity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (lava water);

lava
{
    // transportModel  Newtonian;
    transportModel  CostaMacedonio;
    nu              1.e2;
    rho             2000;
    cp    [0 2 -2 -1 0 0 0] 1150;
    Pr    [0 0 0 0 0 0 0] 10.0;

    CostaMacedonioCoeffs
    {
    nu_ref nu_ref [0 2 -1 0 0 0 0] 1.e4;
    b b [0 0 0 -1 0 0 0] 0.005;
    // kslope kslope [0 2 -1 -1 0 0 0] 0.5;
    T_ref T_ref [0 0 0 1 0 0 0] 300;
    nuMin nuMin [0 2 -1 0 0 0 0] 1e2;
    nuMax nuMax [0 2 -1 0 0 0 0] 1e5;
  }
}

water
{
    // transportModel  Newtonian;
    transportModel  CostaMacedonio;
    nu              1e-06;
    rho             1000;
    cp    [0 2 -2 -1 0 0 0] 4190;
    Pr    [0 0 0 0 0 0 0] 10.0;

    CostaMacedonioCoeffs
    {
    nu_ref nu_ref [0 2 -1 0 0 0 0] 1e-06;
    b b [0 0 0 -1 0 0 0] 3.46;
    // kslope kslope [0 2 -1 -1 0 0 0] 0.5;
    T_ref T_ref [0 0 0 1 0 0 0] 300;
    nuMin nuMin [0 2 -1 0 0 0 0] 1e-6;
    nuMax nuMax [0 2 -1 0 0 0 0] 1e-6;
    }
}


sigma            0.07;

emissivity    [0 0 0 0 0 0 0] 0.96;
sigma_SB    [1 0 -3 -4 0 0 0] 5.67e-8;
fractionalAreaExposed    [0 0 0 0 0 0 0] 1;
T_env    [0 0 0 1 0 0 0] 293;
heatTransferCoeff    [1 0 -3 -1 0 0 0] 2;




// ************************************************************************* //
