tutorials/P100000_termalViscosity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0) //0
    (80 0 0)  //1
    (96 0 0)  //2
    (100 0 0)  //3
    (100 10 0)  //4
    (96 10 0)  //5
    (80 10 0)  //6
    (0 10 0)  //7
    (0 0 2)  //8
    (80 0 2)  //9
    (96 0 2)  //10
    (100 0 2)  //11
    (100 10 2)  //12
    (96 10 2)  //13
    (80 10 2)  //14
    (0 10 2)  //15
    (0 0 10)  //16
    (80 0 10)  //17
    (80 10 10)  //18
    (0 10 10)  //19

);

blocks
(
    hex (0 1 6 7 8 9 14 15) (160 1 4) simpleGrading (1 1 1)
    hex (8 9 14 15 16 17 18 19) (160 1 16) simpleGrading (1 1 1)
    hex (1 2 5 6 9 10 13 14) (32 1 4) simpleGrading (1 1 1)
    hex (2 3 4 5 10 11 12 13) (4 1 4) simpleGrading (1 1 1)
    // hex (10 11 12 13 20 21 22 23) (8 1 32) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type patch;
        faces
        (
            (0 8 15 7)
            (8 16 19 15)
        );
    }
    rightWall
    {
        type patch;
        faces
        (
            (3 4 12 11)
        );
    }
    tunnelWallsLeft
    {
        type wall;
        faces
        (
            (9 14 18 17)
        );
    }
    tunnelWallsTop
    {
        type patch;
        faces
        (
            (9 10 13 14)
        );
    }


    front
    {
        type empty;
        faces
        (
            (0 1 9 8)
            (8 9 17 16)
            (1 2 10 9)
            (2 3 11 10)
        );
    }

    back
    {
        type empty;
        faces
        (
            (7 15 14 6)
            (15 19 18 14)
            (6 14 13 5)
            (5 13 12 4)
        );
    }

    topLava
    {
        type patch;
        faces
        (
            (10 11 12 13)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 7 6 1)
            (1 6 5 2)
            (2 5 4 3)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (16 17 18 19)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
